[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
<S>
<T>
!
"
$
'
(
)
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
=
?
[
]
_
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
ˇ
–
—
’
…
─
##r
##c
##t
##o
##y
##e
##a
##l
##p
##g
##i
##z
##n
##s
##u
##d
##v
##m
##b
##h
##w
##k
##f
##0
##9
##5
##x
##1
##j
##8
##2
##6
##q
##7
##4
##─
##3
##ˇ
##he
##er
the
##in
##an
##al
##re
##on
##en
##es
##or
an
##le
##at
##ar
##ou
and
##ing
to
in
##it
##as
of
##ed
##om
##is
bal
##ra
##ent
##ion
##let
th
ballet
##ic
##anc
##st
wit
with
##ro
st
##ho
##ec
on
##il
##el
##ol
##ig
##ut
danc
re
##am
##ers
com
##ay
##ud
##ve
##ly
be
##ad
pro
##ge
##ation
##ac
##ot
for
you
##ir
##est
##rac
was
ne
##ow
##et
it
wor
##id
comp
al
fr
ch
he
is
##ul
##her
##ter
mo
that
as
cou
##ist
at
##ct
##ur
##im
##og
##um
##any
##and
con
##ver
de
li
wh
##ce
##se
##ht
##ess
by
##hn
work
trac
##ere
dance
new
from
##to
##are
##ld
##ire
ab
##nt
##art
ro
##rt
cl
cho
us
we
##ak
##ill
##ight
ad
whe
##ect
tw
##em
##ear
##ip
##us
##ine
##ents
company
jo
##ass
this
his
pre
##ch
##ant
are
sc
so
##age
##nd
##ff
##ome
ha
or
##reog
##rap
choreog
two
choreograp
can
ex
##ure
##00
##ally
dancers
##ame
##ays
##cl
##ber
##orm
stud
but
has
not
pr
su
##oc
##per
##ile
##mer
##ins
##oug
##ity
tr
year
##ies
##ive
##all
##ard
##out
balanc
ac
##ment
##hine
##reat
class
balanchine
ap
dire
per
sh
some
will
##ther
##ag
##iv
##form
their
##ina
##ory
have
direct
20
fe
le
se
sp
##th
##ok
##si
##du
##our
nut
pho
test
var
were
##crac
##ne
##ker
##ject
##qu
##ank
##ast
comm
prof
project
more
students
##ough
nutcrac
nutcracker
bo
bd
creat
do
her
out
sud
who
##ust
they
##one
##ram
##oll
##ide
count
##ime
prin
photo
bda
po
ve
##ov
##ab
##so
there
##esy
##ary
##ional
##ick
##ell
court
sudo
courtesy
ar
art
over
te
##now
##un
##inal
##ound
inst
##ions
##ical
one
##ach
cont
lik
##aren
john
director
city
had
ny
time
##cb
##cip
##yl
##por
##ie
##ien
##fe
##ines
##led
##ich
your
also
when
perform
201
profess
artist
nycb
che
en
fil
ful
mc
she
ser
sho
says
tak
up
##cess
##ep
##ia
##mi
##ind
##ater
incl
##irst
while
about
user
premi
choreographer
tran
##neight
command
princip
like
professional
mcneight
includ
principal
first
get
other
pl
pi
part
tec
##ug
them
##ord
##ork
##ars
##ould
inter
##ite
ballets
##hool
been
##ade
##ational
char
chines
move
conf
school
choreograph
film
chinese
19
age
amer
dre
ht
just
men
mar
pa
sol
ww
would
york
##ck
##ged
##ial
##son
##day
##ven
##ky
##hed
took
##ican
reg
##ack
its
world
life
what
adm
##claren
app
artistic
techn
american
www
am
bank
co
day
fam
foll
how
him
if
lar
mclaren
want
##ring
##ten
##ose
##ik
##ns
##sent
##sel
##van
##ond
off
##ance
all
works
years
check
full
premiere
transi
follow
18
aud
bec
fa
fre
four
im
kro
ll
many
mak
qu
res
sur
##ry
##op
##os
##ore
##ei
##ap
##ain
##pen
##iz
##ian
##man
##wn
##ft
##hears
##ong
##ors
ann
##ate
##ice
dancer
rehears
##ache
most
lib
which
where
orig
sug
create
counts
install
johnson
dream
krohn
af
ale
bas
cor
cent
di
des
ever
fram
hand
know
log
me
man
made
national
pen
pet
rec
tal
well
##co
##ting
##ove
##lo
##les
##lant
##ps
##gram
##ng
##ue
##ual
##hip
##ward
##anies
##als
##rest
##ous
into
##ition
##raud
thr
than
thing
start
stage
story
only
##igest
program
companies
##ument
rob
rober
add
##empor
classical
##duct
arrest
show
piec
choreography
solo
admin
##self
following
original
after
frame
robert
##emporary
ag
act
bro
car
go
hol
id
ka
la
my
nb
now
our
open
pers
rus
tre
tra
un
##rit
##te
##ton
##tter
##ev
##az
##ib
##ially
##sp
##ss
##dy
##ds
##vil
##hic
##ways
##xt
then
theat
##ink
##eng
##ence
##ated
inv
##ish
##iser
though
##ances
##ston
once
##ely
##igure
rep
reper
##ations
young
always
##ult
atlant
adv
exp
acc
share
feat
##que
body
does
vehic
contemporary
##ylvan
including
paul
famil
##nsylvan
189
alex
center
every
pennsylvan
through
arrested
soloist
kaiser
##ville
theatre
atlanta
pennsylvania
25
aut
bay
bill
bour
cas
cam
came
dat
dec
ek
fo
fin
gu
hel
hist
less
last
mon
mas
mid
mart
mem
mus
mag
num
pas
sin
sec
snow
und
##rist
##ces
##ced
##ts
##ook
##ek
##ail
##part
##non
##ux
##ually
##vel
##bers
##han
##hing
##ful
##ery
these
##rey
##red
anders
toge
##stage
onstage
##olog
##ign
##igh
##ada
product
##ace
##iry
christ
head
##uring
##ummer
deux
able
roy
week
joff
present
scen
##000
##insky
apache
poin
##able
team
##port
server
charged
movement
technolog
transients
rehearsals
sugg
diff
piece
nboc
person
1892
alexand
bournon
data
ekman
master
martins
andersen
together
joffrey
bournonville
300
5000
bl
bot
best
bring
cra
cur
cast
coll
even
fal
foc
fraud
gr
ger
gra
got
hug
ke
loc
long
mel
pec
put
pass
pei
ril
run
sw
som
same
utter
vers
wat
yu
##cen
##ted
##av
##ij
##iation
##ique
##ning
##ned
##summer
##digest
##ves
##vis
##vent
##ml
##ments
##ern
##ered
theater
##ano
##rent
##ates
##athan
##arr
##ark
today
init
inform
##ase
##iss
##isco
##ict
sta
##eld
##ols
dancing
ret
real
beij
##adem
process
##acher
former
##estig
##ract
next
compet
china
could
depart
working
##toire
wheater
##earch
exper
##ures
access
academ
##ival
feel
##anks
projects
created
pos
##abor
teacher
##ience
performance
2017
take
taken
choreographers
intern
configure
films
195
htdigest
html
regina
himself
larcen
wanted
making
installation
based
things
broad
russi
tree
investig
repertoire
vehicles
cash
midsummer
since
under
both
craig
collabor
false
focus
gradu
keep
peck
riles
somet
uttering
information
beijing
larceny
10
av
bow
back
cir
did
doc
during
eff
elo
event
fest
file
fun
found
gl
give
here
home
jam
kol
kind
lot
leng
look
mu
no
night
name
old
own
sl
san
sat
say
tit
tick
vi
vide
very
west
##round
##rument
##ched
##tal
##tent
##od
##yp
##yle
##ave
##la
##pr
##ph
##gi
##gin
##iar
##nect
##nik
##side
##sky
##vor
##bu
##ble
##bins
##way
##ks
##fi
##fer
##fore
##hes
##ination
##rect
##ont
##ley
##ator
##atter
##ators
##arly
##ington
##ites
##itions
often
##edish
##ise
##ently
thir
those
think
##ancisco
without
str
step
style
##ild
reb
read
really
##erse
come
begin
before
##ady
##act
##ots
##ested
need
##ets
##ided
##iday
alth
francisco
##ulent
connect
abs
above
role
close
using
join
canada
exam
##bery
prom
super
##ought
trick
classes
few
lead
left
see
sex
spring
variation
boston
doing
county
post
around
instrument
##iew
performances
enter
commands
partic
##ording
mari
appro
fullington
transient
became
favor
resp
surround
##ized
corps
correct
logo
peter
talent
started
robbins
robbery
ident
##azine
advice
expos
according
familiar
camer
foot
help
musical
second
production
royal
pointe
suggs
differ
alexander
fraudulent
hughes
melina
swedish
staff
department
document
festival
james
kolnik
length
viol
video
third
although
favorite
surrounding
000
16
22
27
200
award
bel
bols
cot
cand
crit
cult
du
dan
don
dra
days
div
done
digest
el
ed
ent
end
each
esp
fi
far
fou
fut
fac
final
ge
hon
har
ham
high
ir
ip
ii
ivan
ju
kar
lit
light
lear
mal
mat
met
might
mast
must
mone
main
narr
oct
ple
pul
pick
ren
rel
ram
rare
rich
sy
sm
sil
set
sect
tch
typ
ubu
vict
view
ws
wal
way
zh
zou
##rib
##ca
##che
##cer
##con
##ccess
##tes
##tain
##ost
##off
##ober
##eal
##au
##aum
##aik
##aev
##ler
##lor
##lic
##ple
##pite
##ias
##ious
##ni
##nter
##name
##nced
##sw
##ser
##ues
##ved
##vinsky
##verse
##mar
##mas
##br
##bs
##bur
##hind
##wing
##ware
##word
##ked
##fraud
##inue
##ang
##ans
##ret
##ress
##ready
##end
##enade
##orge
##ories
anot
anim
##ating
##ative
##ara
##aring
##ounced
too
top
total
inc
ini
ind
insp
intent
##iting
##ities
##ason
##asar
##ased
##oming
##ising
##ision
##ished
##ravinsky
thanks
thought
##ically
##stum
star
stand
stars
stravinsky
##hoi
##ecially
##elt
##ute
danced
requ
refer
beach
behind
props
##get
##otes
forward
neum
##ettes
##ident
already
frien
front
chance
child
iss
mod
counter
##urday
concer
dem
devel
defraud
live
whites
worked
##ntu
roots
chown
users
##akes
##ipa
##chiv
soft
##agement
studi
student
success
classic
shiry
someone
directory
leave
season
boyl
outside
country
prince
##ova
##ovsky
archiv
teach
##inald
johnathan
##iences
##feiting
performed
2015
taking
getting
plac
plum
##ugg
##ordination
movements
justin
march
reginald
technique
amaz
costum
coordination
famous
large
checks
audition
audiences
becau
fairy
free
import
quotes
research
surpr
##opment
##eier
anna
announced
sugar
despite
hands
known
mean
management
petipa
ago
holiday
trad
expla
features
everyone
auth
decided
histor
history
month
members
magazine
numbers
##ailable
christmas
header
presented
scene
apache2
technology
black
bringing
current
germar
local
password
version
initial
##ission
experience
accessory
academy
teachers
international
1954
broadway
russian
investigators
collaboration
graduation
something
available
bowl
circ
eventually
much
saturday
tickets
western
absence
joined
sexual
mariinsky
exposure
cameron
different
documentary
violin
bolshoi
cote
candy
critic
danish
especially
george
masters
money
october
pulled
ramasar
small
tchaik
ubuntu
victim
##burg
another
inspir
neumeier
counterfeiting
concerto
development
whiteside
software
shiryaev
boylston
archives
because
important
explains
germarco
tchaikovsky
23
30
35
34
80
90
92
a2
ara
br
bc
bre
bra
big
brit
batter
ce
cer
cal
cle
cut
call
cind
cred
db
dis
del
dow
dum
dav
er
et
eas
est
eight
fem
five
fall
fell
find
figure
face
felt
gen
gas
gro
game
gard
great
giv
hu
hit
hum
iz
jorm
ken
king
kne
karen
lu
las
led
let
list
line
lov
later
love
link
ma
mi
mk
min
mom
may
mime
mind
nation
nick
nove
nano
os
oper
pm
ph
pan
par
pel
pol
pur
page
poll
park
pract
rent
rol
rest
ranks
sa
sk
sent
sher
sus
search
ter
ton
tou
tas
tay
tire
tag
unt
von
vign
went
wond
writ
yet
zak
##ror
##rip
##rian
##cy
##car
##crip
##tt
##tle
##ters
##tany
##tory
##oz
##yev
##ein
##een
##eare
##ao
##ll
##ls
##lan
##ling
##lay
##less
##light
##pt
##pro
##pect
##page
##pport
##pted
##peare
##ger
##ier
##iff
##ift
##ifi
##nch
##sh
##sen
##dt
##der
##den
##dir
##vol
##vada
##ming
##mber
##mond
##miss
##most
##book
##har
##wh
##wide
##wiz
##jor
##ˇo
##eres
##ering
##erful
##inues
##anes
##anard
##real
##resent
##ons
##onsi
##ened
##ences
##orts
answ
##leged
##lebr
##arp
##arm
##oup
##ouse
##ount
##ousel
tools
##ited
##ither
##itive
baller
##ential
thre
##ices
##icag
##icult
##ancial
##stra
##stem
##stract
##stein
##ross
stol
station
styl
stop
store
stap
state
##ecut
##ecial
##ecca
##ilia
##ilities
##elcon
##igns
dances
reach
##ama
##ami
##ership
better
##adere
##adian
##geyev
##acter
##ached
washing
never
nevada
##idual
complet
compos
alum
alone
aloff
almost
alleged
chall
chicag
heel
height
isn
##ular
##ularly
moved
ass
asked
att
atten
##ury
##imes
cons
dean
white
##cept
##ired
abt
abstract
##rth
claren
clara
used
usually
web
##aker
##illaum
adap
adrian
wheeld
##ective
##ement
##ember
jobs
prep
score
haven
haˇo
orche
cane
canadian
exc
exten
execut
such
support
trust
true
across
accept
apt
permiss
shakes
shanard
##ively
##ividual
lepage
seem
sequ
seven
spot
special
##sib
##duc
##ours
##quently
commun
profile
board
creating
dose
whole
##elling
contact
continues
likely
directors
##iev
##ief
##ledge
yourself
2011
2012
artists
eng
fully
serves
serenade
sergeyev
shoes
upper
##ept
premieres
trans
include
includes
included
place
piano
partn
interested
character
schools
choreographing
choreographic
199
dress
marie
sold
regional
admission
apprent
appeal
amar
wanting
offer
offers
office
offered
worksho
audience
becoming
fair
french
imag
make
makes
quest
resident
##opher
##orship
rehearsal
basically
design
knowledge
login
recent
recently
pieces
carry
carlo
carousel
good
holds
opens
opened
russe
train
unique
##ible
##enging
represent
repertory
##ationship
younger
shares
featuring
vehicle
family
bayadere
finally
financial
guy
guest
guillaum
helm
monte
member
music
number
##fully
productions
christopher
heads
scenes
teams
technologies
suggest
difficult
personal
alexandre
casting
grand
group
located
passion
watch
watched
##aval
##nedy
retinue
realized
competitions
academic
possib
russia
graduates
keeps
sometimes
efforts
glow
looking
older
slide
title
titled
##field
strugg
rebecca
rebelcon
connected
example
prompted
tricky
leadership
entered
particip
particularly
approach
approached
responsi
identity
identifi
footage
stafford
culture
drawing
division
edge
entire
fourth
future
faces
hamburg
highlight
iron
iii
ivanov
june
little
males
please
picked
relationship
rarely
richmond
system
section
views
wsgi
animation
incred
individual
require
friends
modern
studios
teaching
placed
amazing
costumes
surpris
meaning
historian
months
currently
inspiration
a2en
arab
bcso
brittany
battery
celebr
called
cutting
delves
down
dumas
david
easy
facebook
gener
given
izilia
jorma
kennedy
knew
karenina
major
miami
mkdir
minute
moment
nationwide
nickname
november
oscar
opera
panama
paris
pelvis
pollack
parking
roles
said
sheriff
taylor
until
vignettes
wonderful
writer
zakhar
##wizard
ballerina
stolen
styles
staple
washington
composer
alumni
allegedly
challenging
chicago
attend
clarence
adapt
wheeldon
orchestra
extens
permissions
shakespeare
designwizard
representing
guillaume
responsible
identified
highlights
iziliaev
zakharova
